[{
    "url": "Moreno_05.JPG",
    "title": "Honoring a Hero",
    "caption": "Photos from the July 7, 2017 funeral procession for slain San Antonio police officer Miguel Moreno."
}, {
    "url": "Moreno_01.JPG",
    "title": "Honoring a Hero",
    "caption": "Police Chief William McManus presents the flag to Officer Miguel Moreno's parents during the funeral for Officer Moreno, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_02.JPG",
    "title": "Honoring a Hero",
    "caption": "Officers await the arrive of the casket during the funeral procession for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_03.JPG",
    "title": "Honoring a Hero",
    "caption": "A motorcycle procession by San Antonio Police Department awaits the start of the day's funeral service for fallen San Antonio Police officer Miguel Moreno at Porter Loring Funeral Home on Friday, July 7, 2017. Moreno was shot and killed last week when he along with fellow officer Julio Cavazos came under attack after stopping two individuals near the Tobin Hills neighborhood by San Antonio College. Cavazos was also shot but survived the deadly assault. A motorcade of first responders commenced in the morning followed by the funeral procession which took Moreno's family, friends and fellow police officers to a church service at Community Bible Church. A private graveside service concluded the ceremony honoring Moreno."
}, {
    "url": "Moreno_04.JPG",
    "title": "Honoring a Hero",
    "caption": "Matthew Medrano, 7, waves a 'thin blue line' flag as police  vehicles in the procession of slain San Antonio Police Officer Miguel Moreno leave the Alamodome staging area on Friday, July 7, 2017. Officer Moreno was gunned down in a shootout on June 29 and died the next day."

}, {
    "url": "Moreno_06.JPG",
    "title": "Honoring a Hero",
    "caption": "Police on motorcycles lead the first funeral procession northbound on U.S. Highway 281 Friday July 7, 2017 for fallen San Antonio police officer Miguel Moreno. Moreno was fatally shot in the head last week by Andrew C. Bice near West Evergreen and Howard streets."
}, {
    "url": "Moreno_07.JPG",
    "title": "Honoring a Hero",
    "caption": "Mourners exit Porter Loring Funeral Home during the day's funeral service for fallen San Antonio Police officer Miguel Moreno on Friday, July 7, 2017."
}, {
    "url": "Moreno_08.JPG",
    "title": "Honoring a Hero",
    "caption": "The casket is carried away during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_09.JPG",
    "title": "Honoring a Hero",
    "caption": "Shiftmates and classmates enter the church during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_10.JPG",
    "title": "Honoring a Hero",
    "caption": "The casket carrying Officer Miguel Moreno III, who was killed in the line of duty, is brought in a horse-drawn carriage during the funeral procession at the Community Bible Church in San Antonio, Texas on July 7, 2017. His class and shift mates stood followed behind him."
}, {
    "url": "Moreno_11.JPG",
    "title": "Honoring a Hero",
    "caption": "The casket carrying Officer Miguel Moreno III, who was killed in the line of duty, sits in a horse-drawn carriage during his funeral procession at the Community Bible Church in San Antonio, Texas on July 7, 2017. His class and shift mates stood followed behind him."
}, {
    "url": "Moreno_12.JPG",
    "title": "Honoring a Hero",
    "caption": "The San Antonio Police Department's Honor Guard carry the casket from the hearse to the horse-drawn carriage during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_13.JPG",
    "title": "Honoring a Hero",
    "caption": "The San Antonio Police Department's Honor Guard carry the casket from the hearse to the horse-drawn carriage during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_14.JPG",
    "title": "Honoring a Hero",
    "caption": "The honor flag ceremony was performed by the San Antonio Police Department's Honor Guard during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_15.JPG",
    "title": "Honoring a Hero",
    "caption": "Governor Greg Abbott shakes hands with an officer before the funeral service for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_16.JPG",
    "title": "Honoring a Hero",
    "caption": "A Blue Eagle fly-over is performed during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_17.JPG",
    "title": "Honoring a Hero",
    "caption": "The family watches as the San Antonio Police Department's Honor Guard carries the casket during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_18.JPG",
    "title": "Honoring a Hero",
    "caption": "The honor flag ceremony was performed by the San Antonio Police Department's Honor Guard during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_19.JPG",
    "title": "Honoring a Hero",
    "caption": "Officers salute while the honor flag ceremony was performed by the San Antonio Police Department's Honor Guard during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_20.JPG",
    "title": "Honoring a Hero",
    "caption": "Police Chief William McManus carries a flag to present to the family during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_21.JPG",
    "title": "Honoring a Hero",
    "caption": "Police Chief William McManus presents the flag to Officer Miguel Moreno's parents during the funeral for Officer Moreno, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_22.JPG",
    "title": "Honoring a Hero",
    "caption": "The San Antonio Police Department's Honor Guard carries the casket by the family during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_23.JPG",
    "title": "Honoring a Hero",
    "caption": "His classmates get emotional hearing a story about Officer Miguel Moreno III, who was killed in the line of duty, during his funeral service at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_24.JPG",
    "title": "Honoring a Hero",
    "caption": "The casket sits in the front of the church during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_25.JPG",
    "title": "Honoring a Hero",
    "caption": "Mayor Ron Nirenberg speaks during the funeral service for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_26.JPG",
    "title": "Honoring a Hero",
    "caption": "His classmates listen to a story about Officer Miguel Moreno III, who was killed in the line of duty, during his funeral service at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_27.JPG",
    "title": "Honoring a Hero",
    "caption": "The casket is carried out during the funeral for Officer Miguel Moreno III, who was killed in the line of duty, at the Community Bible Church in San Antonio, Texas on July 7, 2017."
}, {
    "url": "Moreno_28.JPG",
    "title": "Honoring a Hero",
    "caption": "Officer Miguel Moreno's parents walk to the final ceremonies during his funeral service at the Community Bible Church in San Antonio, Texas on July 7, 2017."
} ]
